<?php
$server='localhost';	
$username='root';
$password='';
$con=mysql_connect($server,$username,$password);	
if(!$con)				
	die("can not connect to the server $server");
$q=mysql_query('CREATE DATABASE IF NOT EXISTS tourist',$con);
if(!$q)
	die("failed to create the database");	
mysql_select_db('tourist');
$a="CREATE TABLE IF NOT EXISTS city (
c_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
name VARCHAR(100) NOT NULL
)
";
mysql_query("insert into city values('','Aswan')");

mysql_query($a);
$sql="
CREATE TABLE IF NOT EXISTS place(
p_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
c_id INT NOT NULL,
name VARCHAR(100) NOT NULL,
img VARCHAR(100) NOT NULL,
price DECIMAL(4,2) NOT NULL,
description TEXT NOT NULL
)
";
mysql_query($sql);
$r="insert into place values('',1,'مسجد الطابية بمدينة أسوان','images/42939-1-(11).jpg',0.00,'ويعد مسجد بدر بمنطقة الطابية من أهم المساجد بأسوان، ويقبل عليه الكثير من المواطنين فى العديد من المناسبات الدينية والاحتفالات والأعياد، كما أنه مزار سياحى تأتى إليه الأفواج السياحية لزيارته نظراً لأهميته التاريخية، وبسبب ارتفاعه النسبى عن المدينة يمكن للزائرين رؤية المدينة بأكملها من فوق قمة المسجد، وسيخدم لاستطلاع هلال شهر رمضان، وفى المساء يقام به عرض الصوت والضوء.'),
('',1,'السد العالى','images/48162-1-(1).jpg',100.00,'لا تخفى الأهمية التاريخية للسد العالى عن ذاكرة المصريين عبر العصور المتلاحقة، فهو أضخم مشروع قومى خلال القرن العشرين، ويتمتع السد العالى من الناحية السياحية بمناظر خلابة لمجرى نهر النيل وبوابات المياه التى يمكن رصدها من خلال نقطة المشاهدة بالسد العالى، وترتفع المياه بغزارة عند فتح بوابات السد العالى لترسم أمام السد العالى مشهداً لقوس قزح بألوان الطيف السبعة.'),
('',1,'رمز الصداقة بالسد العالى','images/55351-1-(2).jpg',50.00,'يمكن لزائر السد العالى أن يتمتع أيضاً بتفقد موقع رمز الصداقة المصرية السوفيتية، وهو عبارة عن بناء يشبه زهرة اللوتس المفتوحة، والذى صممه المهندس المعمارى الروسى يورى اومليتر شينكو خلال عام 1967، وعلى الرغم من أن ارتفاعه فقط 72 متراً، إلا أن ارتفاع الرمز يضاهى هضبة المقطم، وأعلى من برج القاهرة الذى يصل ارتفاعه إلى 600 متراً.'),
('',1,'متحف النيل بأسوان','images/39417-1-(10).jpg',75.00,'حظى متحف النيل فى مدينة أسوان، بأهمية لدى المواطنين والسائحين الأجانب، على الرغم من حداثة إنشائه خلال شهر يناير من العام الجارى بالتزامن مع عيد أسوان القومى، وتم وضعه على خارطة المواقع السياحية بأسوان ويتكون المتحف المجاور لخزان أسوان، من مبنى 3 طوابق وحديقة، ويضم مئات الصور والمعروضات التى تحكى تاريخ النيل والمشروعات المصرية التى أقيمت عليه، بجانب عرض لأهم المشروعات القومية لوزارة الرى، والتى ساهمت فيها بدءاً من القناطر الخيرية أيام محمد على، مروراً بترعة السلام ومشروع توشكى، ونهاية بمشروع 4 ملايين فدان، ومشروعات حماية وإنقاذ نهر النيل، وأهم الوثائق التاريخية، ومنها وثيقة اتفاقية 59 بين مصر والسودان، ووثيقة حماية نهر النيل.'),
('',1,'متحف النوبة','images/58255-1-(6).jpg',60.00,'وهو المتحف الذى أنشأته منظمة اليونسكو لعرض الآثار الخاصة بالحضارة النوبية القديمة، عام 1997، حيث يحتل ربوة عالية تجاوره القباب الفاطمية الإسلامية المعروفة، من ثلاثة أدوار، الدور الأرضى، ويضم مدخل رئيسى وقاعة عرض وقاعة المحاضرات وقاعة لكبار الزوار وغرف الأمن والإدارة وغرفة مدير عام المتاحف، والدور الأول، ويضم الكافيتريا والمكتبة وأمناء المتحف وحجرات تصوير فوتوغرافى وميكروفيلم وإدارة المتحف والخدمات، والبدروم ويضم يحتوى على قاعة العرض الرئيسية ومعامل الترميم والورش ومخازن الآثار ومركز استقبال والمسرح المكشوف، ويحتوى المتحف على 5 آلاف قطعة أثرية تمثل مراحل تطور الحضارة والتراث النوبى، ويضم العرض الخارجى للمتحف 86 قطعة فريدة من التماثيل الكبيرة واللوحات الأثرية مختلفة الأحجام.'),
('',1,'جزيرة النباتات بأسوان','images/80186-1-(3).jpg',40.00,'تعد الحديقة النباتية بأسوان، واحدة من أندر الجزر النيلية فى العالم والتى تتمتع بوجود أكثر من 500 نوع نباتى مختلف، من جميع أنحاء العالم'),
('',1,'حديقة الأميرة فريال','images/72656-1-(9).jpg',80.00,'حديقة فريال بانوراما جمالية على صفحة نهر النيل بمحافظة أسوان من الجهة الجنوبية حيث تم إنشاؤها فى الأربعينيات برعاية من الأميرة فريال شقيقة الملك فاروق، وأطلق اسمها على الحديقة تقديراً لدورها فى إنشائها.'),
('',1,'غرب سهيل','images/64203-1-(5).jpg',150.00,'تحظى منطقة غرب سهيل بمدينة أسوان، بأهمية سياحية خاصة، ولجأت معظم شركات السياحة حالياً إلى وضعها على خارطة السائح الأجنبى الزائر لمصر ومحافظة أسوان ونجح أبناء النوبة فى تجسيد الفلكور النوبى والموروثات النوبية القديمة فى شكل مزار سياحى يقدم للسائحين على ضفاف نهر النيل بشكل مبسط، يختلف عن الفنادق العملاقة والبنايات الحديثة.'),
('',1,'الجزر النيلية بأسوان','images/38026-1-(4).jpg',200.00,'أسوان استطاعت أن تحظى بلقب عروس النيل بفضل الجزر النيلية والصخور الطبيعية التى حباها الله بها وسط نهر النيل، ويكن للمواطن أن يصطحب زوجته وأولاده فى رحلة نيلية عبر المراكب النيلية – لم تكلفه الكثير من المال – ويستمتع خلال ساعة بالمناظر الخلابة والطيعة الساحرة وسط نهر النيل وفى العيد يمكن قضاء اليوم كاملاً على إحدى الجزر النيلية، ومن أشهر هذه الجزر  هيسة وبربر والتمساح وغيرها.'),
('',1,'معبد ابوسمبل','images/41346-1-(7).jpg',400.00,'تعد المعابد الفرعونية قبلة الكثير من الزائرين خلال إجازة العيد، ويحرص أبناء أسوان بمشاهدة الحضارة الفرعونية العريقة داخل معبد أبوسمبل، والذى يضم معبدى الملك رمسيس الثانى، وزوجته الملكة نفارتارى، على ضفاف نهر النيل جنوب مدينة أسوان كما يحرص الكثير من أبناء أسوان والسائحين على زيارة معبد كوم أمبو على ضفاف النيل بمنطقة البيارة بمحافظة أسوان، والاستمتاع بمشاهدة الحضارة الفرعونية وعروض الصوت والضوء، بجانب تفقد متحف التمساح بالمعبد، والجلوس على الكافيهات القريبة من المعبد ونهر النيل. '),
('',2,'معبد الكرنك الاقصر','images/Tourism-in-Luxor-4.jpg',80.00,'معبد الكرنك الاقصر Luxor Karnak Temple هو سلسلة من دور العبادة التي يرجع تاريخها إلى العصر الفرعوني، وتمتد على مساحة أكثر من 60 فدان شمال مدينة الاقصر ، ويُعد معبد الكرنك هو الأكبر من نوعه على مستوى مصر والعالم.
يعكس هذا المعبد من خلال مراحل بنائه وتطوره تاريخ وثقافة مصر القديمة، تبدأ من الحقبة الفرعونية الوسطى وتنتهي بعصر البطالمة عبر 8 بوابات كل بوابة منها تقود إلى بناء مُهيب من 10 أبنية عظيمة، تجعل منه واحد من أهم معالم السياحة في مصر .
فإن كنت على استعداد لركوب آلة الزمن والإبحار بين حضارات ما قبل 7 آلاف سنة من الآن، فإبقى معنا خلال هذه الرحلة المُثيرة داخل معبد الكرنك الاقصر الشهير.'),
('',2,'وادي الملوك بالاقصر','images/Tourism-in-Luxor-2.jpg',150.00,'
وادي الملوك الاقصر أو وادي بيبان الملوك Valley of kings يقع على الضفة الغربية لنهر النيل مقابلًا لمدينة الأقصر، ويضم مقابر لملوك وحاشية الأسر الفرعونية من الأسرة 18 وحتى 20 والتي حكمت مصر على مدار 5 قرون.
وينقسم الوادي إلى جهتين جهة شرقية تضم أغلب المقابر الملكية وجهة غربية، كما تتراوح مقابره ما بين البسيطة والمُعقدة الكبيرة التي تضم نحو 120 مقبرة تقريبًا تم بنائها ما بين القرنين 11 و16 قبل الميلاد، ويعد من أهم معالم السياحة في مصر .'),
('',2,'تمثالي ممنون في الاقصر','images/tourism-luxor-1.jpg',50.00,'تمثال ممنون الاقصر Statue of Memnon أو كما أطلق عليهما قديمًا التماثيل الغناء، الذي يعد من أجمل معالم السياحة في الاقصر حيث كانا يشتهرا في العصور القديمة بصدور أصواتًا غير معروفة السبب وقت الفجر، ومع مرور الزمن فسر العلماء تلك الأصوات بأنها نتيجة مرور الهواء بمسام الحجارة الضخمة وقت السكون.
ويقع تمثالي ممنون الاقصر في البر الغربي على الطريق الواصل إلى مقبرة طيبة في الأقصر بمنطقة وادي الملوك، حيث يستقبلا الزوار الوافدين من الضفة الشرقية لنهر النيل، ويُجسدا الفرعون أمنحتب الثالث وزوجته تيي، وقد تم صنعهما في القرن الرابع عشر قبل الميلاد بارتفاع لكلٍ منهما يصل إلى حوالي 22 متر، وهو واحد من أهم معالم السياحة في مصر .'),
('',2,'معبد هابو الاقصر','images/Tourism-in-Luxor-2-1.jpg',65.00,'معبد هابو بالاقصر Habu temple in Luxor أو كما يُعرف بمعبد رمسيس الثالث في مدينة هابو بالأقصر هو معبد جنائزي شُيّد في بداية عهد الملك رمسيس الثالث سليل الأسرة 20 خلال عصر الدولة الفرعونية الحديثة ليُصبح الآن من أكبر المعابد الجنائزية المصرية خلال هذا العصر.
وقد اختلفت الأقاويل حول سبب شهرة المعبد بهذا الاسم، فالبعض يُرجح أن هابو هو اسم كاهن كان يسكن المدينة القبطية التي كانت مبنية بين أسوار المعبد، بينما يُرجح البعض الآخر أن الاسم يرجع إلى أمنحتب بن حابو وزير أمنحتب الثالث.
يعتبر المعبد من اشهر الاماكن السياحية في الاقصر مصر .'),
('',2,'معبد حتشبسوت','images/Tourism-in-Luxor-1-1.jpg',80.00,'   
 معبد حتشبسوت الاقصر الشهير أو كما يُسمى بمعبد الدير البحري Mortuary Temple of Hatshepsut هو معبد جنائزي شُيّدَ على الضفة الغربية لنهر النيل في مدينة الاقصر على مدار 15 عامًا من حكم الملكة حتشبسوت على طراز يختلف تمامًا عن غيره من المعابد الشرقية.
فالمعبد مُشيّد من الحجر الجيري المُلوّن، وتحول في نهاية الحكم البطلمي ومع بداية انتشار المسيحية في مصر إلى دير قبطي قبل أن يعود لأصله مرة أخرى، ورغم ما مر بمعبد حتشبسوت طيلة هذه القرون لا يزال له جماله وسحره الخاص مما جعله من أهم معالم السياحة في مصر .'),
('',2,'معبد الاقصر','images/LuXor-temple.jpg',70.00,'معبد الاقصر Luxor Temple واحد من أهم وأجمل المعابد المصرية القديمة التي شُيّدت على الضفة الشرقية لنهر النيل بالأقصر مُنذ عام 1400 قبل الميلاد، تقديسًا للإله آمون وزوجته موت وابنهما خونسو أو مَا يُطلق عليهم ثالوث طيبة المُقدّس، ويعد من أهم معالم السياحة في الاقصر .
ويضم المعبد مجموعة رائعة من الصروح التي تم تشييدها في عهد الملوك أمنحوتب الثالث، تحتمس الثالث، رمسيس الثاني، حتشبسوت، توت عنخ آمون. واليوم سوف نأخُذكَ في جولة قصيرة داخل معبد الاقصر لنتعرف سويًا على واحد من أجمل معالم السياحة في مصر .')
,('',2,'متحف الاقصر','images/Luxor-Museum.jpg',90.00,'متحف الاقصر Museum of Luxor هذا المكان الذي يضم بداخله التاريخ المصري العريق ومجموعة نادرة من المعروضات تُغطي فترة زمنية تزيد عن 4 آلاف عامًا، بدايةً من عصور ما قبل الميلاد وصولًا إلى العصر الإسلامي، وذلك على مساحة تبلغ 1595 متر مربع.
يقع متحف الاقصر بالضفة الشرقية من نهر النيل في مدينة الاقصر ، ويحتضنه من الجنوب معبد الأقصر ومن الشمال معبد الكرنك، وقد تم تصميمه ليكون مواجهًا للنيل، وتم افتتاحه لأول مرة للجمهور عام 1975، ويعد من أهم معالم السياحة في مصر .'),
('',2,'الحديقة الدولية بالاقصر','images/Tourism-in-Luxor-1.jpg',40.00,'يظن الكثيرون أن السياحة في الاقصر سياحة آثار فحسب تفتقر إلى جوانب المتعة والترفيه التي قد تتطلبها الرحلات العائلية بصحبة الأطفال، ولكن في الحقيقة تضم الأقصر سلسلة من الحدائق والمُسطحات الخضراء أشهرها الحديقة الدولية حيث تجتمع الخُضرة مع الماء العذب الساحر.'),
('',3,'اهرمات الجيزة بالقاهرة','images/giza-pyramid-complex.jpg',20.00,' 
اهرامات مصر الجيزة في القاهرة تقع على هضبة الجيزة في محافظة الجيزة اي على الضفة الغربية لنهر النيل .وهي تشمل ثلاثة اهرامات خوفو ،خفرع ،منقرع والتي بنيت قبل حوالي 25 قرن قبل الميلاد وهي مقابر ملكية كل منها يحمل اسم الملك الذي بناه والذي دفن فيه والبناء الهرمي هنا هو مرحلة تطور عمارة المقابر في مصر القديمة. وتعد الاهرامات من اهم اماكن السياحة في مصر
تتصف اهرامات مصر الثلاثة بأنها احد اهم عجائب الدنيا السبعة واحد اكبر الغاز التاريخ القديم والحديث واهم الاماكن السياحية في القاهرة'),
('',3,'القرية الفرعونيّة في القاهرة','images/Pharonic-Village6.jpg',150.00,'أنشئ القرية الفرعونية في مدينة القاهرة المعماري المصري حسن رجب وقد جائته تلك الفكرة عند زيارته لامريكا ورؤيته لقرية ويليامزبيرغ في فيرجينيا التي تحكي حياة المستوطنين الاوائل للولايات المتحدة ووقع اختياره على جزيرة يعقوب كمكان للقرية الفرعونية.
وبدأ العمل فيها في عام 1977 وغرس 5000 شجرة من الاشجار التي تتميز بها مصر الفرعونية وجرى حفر الممرات والقنوات المائية
وشيئاً فشيئاً تحقق الحلم وفتحت هذه القرية المتكاملة في عام 1984 ستجد في القرية الفرعونية اشهر معابد ملوك الفراعنة
وحياة المصري القديم البسيطة بين الزراعة والصيد وتحنيط الموتى والكتابة على الورق.'),
('',3,'خان الخليلي','images/khan-el-khalili-cairo.jpg',00.00,'خان الخليلي احد أحياء القاهرة القديمة، وهو يتمتع بجذب سياحي كبير بالنسبة لزوار مدينة القاهرة ومصر بشكل عام. يتميز بوجود بازارات ومحلات ومطاعم شعبية، كما يتميز بكثرة أعداد السياح واعتياد سكانه عليهم.
خان الخليلي واحد من أعرق أسواق الشرق، يزيد عمره عن 600 عام، وما زال معماره الأصيل باقياً على حاله منذ عصر المماليك وحتى الآن. ويعتبر من افضل اماكن السياحة في القاهرة'),
('',3,'برج القاهرة','images/cairo-tower.jpg',50.00,'برج القاهرة يقع في مدينة القاهرة المصرية ، تم بناؤه بين عامي 1956 و 1961 من الخرسانة المسلحة على تصميم زهرة اللوتس المصرية، من تصميم المهندس نعوم شبيب، ويقع في قلب القاهرة على جزيرة الزمالك بنهر النيل.
يصل ارتفاعه إلى 187 متراً وهو أعلى من الهرم الأكبر بالجيزة بحوالي 43 مترا، حيث يعد من اهم اماكن السياحة في القاهرة'),
('',3,'قصر عابدين','images/abdeen-palace.jpg',100.00,'يعتبر قصر عابدين Abdeen Palace في مدينة القاهرة من أشهر القصور المصرية التي شيدت خلال حكم أسرة محمد علي باشا لمصر حيث كان مقراً للحكم ‏من العام 1872 حتى العام 1952، وشهد الكثير من الأحداث منذ العهد الملكي ،وحتى نشأة القاهرة الحديثة.
يعد قصر عابدين تحفة ‏تاريخية نادرة بالشكل الذي حوله إلى متحف يعكس الفخامة التي شيد بها القصر ويحرص الكثير من المهتمين بالمتاحف على زيارته، حيث يعتبر من افضل اماكن السياحة في القاهرة مصر'),
('',3,'دار الأوبرا المصرية','images/Cairo-Opera-House.jpg',200.00,'دار الأوبرا المصرية cairo opera house ، أو المركز الثقافي القومي أفتتحت في عام 1988 وتقع في مبناها الجديد والذي تم تشييده كمنحة من الحكومة اليابانية لنظيرتها المصرية بأرض الجزيرة في مدينة القاهرة'),
('',3,'قصر البارون','images/Baron-Empain-Palace-2.jpg',400.00,'قصر البارون بالقاهرة Baron Empain Palace هو تحفة معمارية فريدة من نوعها في مدينة القاهرة ، شيده المليونير البلجيكي البارون ادوار، والذي جاء إلى مصر من الهند في نهاية القرن التاسع عشر بعد وقت قليل من افتتاح قناة السويس.
يقع القصر في قلب منطقة مصر الجديدة بالقاهرة، تحديداً في شارع العروبة على الطريق الرئيسي المؤدي الى مطار القاهرة الدولي. ويعتبر من اشهر الاماكن السياحية في القاهرة'),
('',3,'مجمع سيتي ستارز','images/city-star-mall.jpg',0.00,'مول سيتى ستارز في مدينة القاهرة هو مركز تجاري أفتتح في ديسمبر عام 2004 يقع في مدينة نصر وهو يعتبر أول مشروع للتنمية المتكاملة من نوعه في الشرق الأوسط وأفريقيا وهو أكبر مركز تجاري في مصر.
طرازه يحاكي الحضارة المصرية القديمة حيث يتكون من ثلاثة أهرامات زجاجية جزئياً يحيط بها 11 برج بالاضافة الى مبنى كبير منفصل هو عبارة عن مجمع محلات للتسوق ونلاحظ ان البنية التحتية للمول متطورة ومجهزة بشبكات وسائط اعلام متعددة وخدمات الى جانب 6000 مرفق للمركبات لسهولة وقوف السيارات في الاماكن المغلقة.'),
('',4,'متحف الاسكندرية القومي','images/alexandria-national-museum.jpg',150.00,'متحف الاسكندرية القومي Alexandria National Museum هو أحد أهم متاحف الاسكندرية مصر ،يحتوي المتحف على مايزيد عن 1800 قطعة أثرية تمثل معظم العصور التي مرت على المدينة التي تأسست في العام 332 ق.م
يقع على طريق الحرية، ومبنى المتحف هو عبارة عن قصر سابق لاحدى تجار الاخشاب الأثرياء في المدينة وهو أسعد باسيلي الذي قام بانشائه على طراز المعمار الايطالي، ويعتبر من اشهر اماكن السياحة في الاسكندرية'),
('',4,'المسرح الروماني','images/Roman-Amphitheatre.jpg',15.00,'
المسرح الروماني بالاسكندرية Roman Amphitheatre ، يقع المسرح في كوم الدكة، وهو أحد آثار العصر الروماني وقد تم بناءه في بداية القرن الرابع ميلادي.
ويعتبر المسرح الروماني الآن من اهم الاماكن السياحية في الاسكندرية'),
('',4,'مول الاسكندرية سيتي سنتر','images/City-Centre-Alexandria.jpg',00.00,'يعد مول الاسكندرية سيتي سنتر City Centre Alexandria احد اشهر الاماكن السياحية في الاسكندرية ويتميز بموقع رائع على طريق الاسكندرية القاهرة الصحراوي ويبعد مسافة قريبة عن وسط مدينة الاسكندرية ، تم افتتاحه في عام 2003 ليضم اكثر من 150 متجراً لبيع العديد من المنتجات المتنوعة من الماركات العالمية.'),
('',4,'قصر المنتزه','images/montaza-palace.jpg',10.00,'قصر المنتزه بالاسكندرية montaza palace مابين الروعة والجمال الطبيعي والحدائق الخلابة والشواطئ الساحرة يقع قصر المنتزه في مدينة الاسكندرية مصر .
قام بتشييد المنتزه محمد علي باشا ليكون مقراً صيفياً لاسرته لقضاء أشهر الصيف الحارة والذي يعتبر الآن أحد رموز الجمال النادر في العالم.'),
('',4,'متحف الأحياء المائية','images/Alexandria-Aquarium.jpg',15.00,'متحف المجوهرات الملكية وهو متحف يعرض مجوهرات الأسر المالكة التي حكمت مصر، ويقع في مدينة الإسكندرية.
شيد القصر عام 1919 في منطقة زيزينيا ويعتبر تحفة معمارية فريدة من نوعها، ومن افضل اماكن السياحة في مصر
وتبلغ مساحته 4185 متراً مربعا وكان يؤول للأميرة فاطمة الزهراء إحدى أميرات الأسرة المالكة، مما جعله من اهم متاحف الاسكندرية العريقة.'),
('',4,'قلعة قايتباي','images/kayitbay-castle.jpg',40.00,'تعد قلعة قايتباي kayitbay castle من اهم الاماكن السياحية في الاسكندرية ، حيث تقع في نهاية جزيرة فاروس بأقصى غرب مدينة الإسكندرية ويحيط بها البحر من ثلاث جهات مما يعطيها روعة وجمالاً خيالياً لتكون اسطورة عروس البحر الأبيض المتوسط.
يعود بناء القلعة الى عام 884 هـ / 1477 م  وتعتبر احد اقدم الاماكن السياحية في الاسكندرية كما انها احدى عجائب الدنيا السبعة.')
";
$e=mysql_query($r);
if(!$e)
	die("failed to create the database");	

?>